#+title: 
#+subtitle: 1 weeks by lsk
#+date: <2020-10-21 Tue 18:00>
#+tags: python, bash, elisp, lisp, zoom
#+property: header-args:bash :results verbatim
#+property: header-args:elisp :exports both
#+property: header-args:ipython :session mglearn1021 :tangle "mglearn201021.py" :exports both

#+author: srolisp

# * ipynb -> txt
# #+begin_src bash
#   jupyter nbconvert --to script "./drive-download-20201020T091917Z-001/*.ipynb" 
# #+end_src

* install opencv 
#+begin_src bash :results verbatim :session
pip install opencv-python
#+end_src

#+RESULTS:
: Collecting opencv-python
:   Downloading opencv_python-4.4.0.44-cp37-cp37m-macosx_10_13_x86_64.whl (52.3 MB)
: Requirement already satisfied: numpy>=1.14.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from opencv-python) (1.18.5)
: Installing collected packages: opencv-python
: Successfully installed opencv-python-4.4.0.44

#+begin_src bash :results verbatim
pip list
#+end_src

#+RESULTS:
#+begin_example
Package                Version
---------------------- ---------
absl-py                0.10.0
appdirs                1.4.4
appnope                0.1.0
argon2-cffi            20.1.0
astroid                2.4.2
astunparse             1.6.3
attrs                  20.2.0
autopep8               1.5.4
backcall               0.2.0
beautifulsoup4         4.6.0
bleach                 3.1.5
boto                   2.49.0
boto3                  1.15.2
botocore               1.18.2
branca                 0.4.1
cachetools             4.1.1
certifi                2020.6.20
cffi                   1.14.2
chardet                3.0.4
click                  7.1.2
colorama               0.4.3
cycler                 0.10.0
decorator              4.4.2
defusedxml             0.6.0
distlib                0.3.1
entrypoints            0.3
filelock               3.0.12
flake8                 3.8.3
folium                 0.11.0
gast                   0.3.3
gensim                 3.8.3
google-auth            1.21.2
google-auth-oauthlib   0.4.1
google-pasta           0.2.0
googlemaps             4.4.2
graphviz               0.14.1
grpcio                 1.32.0
h5py                   2.10.0
idna                   2.10
imageio                2.9.0
importlib-metadata     1.7.0
ipykernel              5.3.4
ipython                7.18.1
ipython-genutils       0.2.0
ipywidgets             7.5.1
isort                  5.5.1
jedi                   0.17.2
Jinja2                 2.11.2
jmespath               0.10.0
joblib                 0.16.0
JPype1                 1.0.2
jsonschema             3.2.0
jupyter                1.0.0
jupyter-client         6.1.7
jupyter-console        6.2.0
jupyter-core           4.6.3
Keras                  2.4.3
Keras-Preprocessing    1.1.2
kiwisolver             1.2.0
konlpy                 0.5.2
lazy-object-proxy      1.4.3
lxml                   4.5.2
Markdown               3.2.2
MarkupSafe             1.1.1
matplotlib             3.3.1
mccabe                 0.6.1
mglearn                0.1.9
mistune                0.8.4
nbconvert              5.6.1
nbformat               5.0.7
nltk                   3.5
notebook               6.1.3
numpy                  1.18.5
oauthlib               3.1.0
opt-einsum             3.3.0
packaging              20.4
pandas                 1.1.1
pandocfilters          1.4.2
parso                  0.7.1
pexpect                4.8.0
pickleshare            0.7.5
Pillow                 7.2.0
pip                    20.2.2
pluggy                 0.13.1
prometheus-client      0.8.0
prompt-toolkit         3.0.7
protobuf               3.13.0
ptyprocess             0.6.0
pyasn1                 0.4.8
pyasn1-modules         0.2.8
pycodestyle            2.6.0
pycparser              2.20
pydocstyle             5.1.1
pyflakes               2.2.0
Pygments               2.6.1
pylint                 2.6.0
pyparsing              2.4.7
pyrsistent             0.16.0
PySocks                1.7.1
python-dateutil        2.8.1
python-jsonrpc-server  0.3.4
python-language-server 0.34.1
pytz                   2020.1
PyYAML                 5.3.1
pyzmq                  19.0.2
qtconsole              4.7.7
QtPy                   1.9.0
regex                  2020.7.14
requests               2.24.0
requests-oauthlib      1.3.0
rope                   0.17.0
rsa                    4.6
s3transfer             0.3.3
scikit-learn           0.23.2
scipy                  1.4.1
seaborn                0.11.0
selenium               3.141.0
Send2Trash             1.5.0
setuptools             49.6.0
six                    1.15.0
smart-open             2.1.1
snowballstemmer        2.0.0
tensorboard            2.3.0
tensorboard-plugin-wit 1.7.0
tensorflow             2.3.0
tensorflow-estimator   2.3.0
termcolor              1.1.0
terminado              0.8.3
testpath               0.4.4
threadpoolctl          2.1.0
toml                   0.10.1
tornado                6.0.4
tqdm                   4.49.0
traitlets              5.0.4
tweepy                 3.9.0
twython                3.8.2
typed-ast              1.4.1
typing-extensions      3.7.4.3
ujson                  1.35
urllib3                1.25.10
virtualenv             20.0.31
wcwidth                0.2.5
webencodings           0.5.1
Werkzeug               1.0.1
wheel                  0.35.1
widgetsnbextension     3.5.1
wrapt                  1.12.1
xlrd                   1.2.0
yapf                   0.30.0
zipp                   3.1.0
#+end_example

#+begin_src bash :results verbatim
pip install --upgrade pip

#+end_src

#+RESULTS:
: Collecting pip
:   Downloading pip-20.2.4-py2.py3-none-any.whl (1.5 MB)
: Installing collected packages: pip
:   Attempting uninstall: pip
:     Found existing installation: pip 20.2.2
:     Uninstalling pip-20.2.2:
:       Successfully uninstalled pip-20.2.2
: Successfully installed pip-20.2.4

#+begin_src bash :results verbatim
pip install opencv-contrib-python
#+end_src

#+RESULTS:
: Collecting opencv-contrib-python
:   Using cached opencv_contrib_python-4.4.0.44-cp37-cp37m-macosx_10_13_x86_64.whl (64.0 MB)
: Requirement already satisfied: numpy>=1.14.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from opencv-contrib-python) (1.18.5)
: Installing collected packages: opencv-contrib-python
: Successfully installed opencv-contrib-python-4.4.0.44

#+begin_src bash :results verbatim
pip list
#+end_src

#+RESULTS:
#+begin_example
Package                Version
---------------------- ---------
absl-py                0.10.0
appdirs                1.4.4
appnope                0.1.0
argon2-cffi            20.1.0
astroid                2.4.2
astunparse             1.6.3
attrs                  20.2.0
autopep8               1.5.4
backcall               0.2.0
beautifulsoup4         4.6.0
bleach                 3.1.5
boto                   2.49.0
boto3                  1.15.2
botocore               1.18.2
branca                 0.4.1
cachetools             4.1.1
certifi                2020.6.20
cffi                   1.14.2
chardet                3.0.4
click                  7.1.2
colorama               0.4.3
cycler                 0.10.0
decorator              4.4.2
defusedxml             0.6.0
distlib                0.3.1
entrypoints            0.3
filelock               3.0.12
flake8                 3.8.3
folium                 0.11.0
gast                   0.3.3
gensim                 3.8.3
google-auth            1.21.2
google-auth-oauthlib   0.4.1
google-pasta           0.2.0
googlemaps             4.4.2
graphviz               0.14.1
grpcio                 1.32.0
h5py                   2.10.0
idna                   2.10
imageio                2.9.0
importlib-metadata     1.7.0
ipykernel              5.3.4
ipython                7.18.1
ipython-genutils       0.2.0
ipywidgets             7.5.1
isort                  5.5.1
jedi                   0.17.2
Jinja2                 2.11.2
jmespath               0.10.0
joblib                 0.16.0
JPype1                 1.0.2
jsonschema             3.2.0
jupyter                1.0.0
jupyter-client         6.1.7
jupyter-console        6.2.0
jupyter-core           4.6.3
Keras                  2.4.3
Keras-Preprocessing    1.1.2
kiwisolver             1.2.0
konlpy                 0.5.2
lazy-object-proxy      1.4.3
lxml                   4.5.2
Markdown               3.2.2
MarkupSafe             1.1.1
matplotlib             3.3.1
mccabe                 0.6.1
mglearn                0.1.9
mistune                0.8.4
nbconvert              5.6.1
nbformat               5.0.7
nltk                   3.5
notebook               6.1.3
numpy                  1.18.5
oauthlib               3.1.0
opencv-contrib-python  4.4.0.44
opt-einsum             3.3.0
packaging              20.4
pandas                 1.1.1
pandocfilters          1.4.2
parso                  0.7.1
pexpect                4.8.0
pickleshare            0.7.5
Pillow                 7.2.0
pip                    20.2.4
pluggy                 0.13.1
prometheus-client      0.8.0
prompt-toolkit         3.0.7
protobuf               3.13.0
ptyprocess             0.6.0
pyasn1                 0.4.8
pyasn1-modules         0.2.8
pycodestyle            2.6.0
pycparser              2.20
pydocstyle             5.1.1
pyflakes               2.2.0
Pygments               2.6.1
pylint                 2.6.0
pyparsing              2.4.7
pyrsistent             0.16.0
PySocks                1.7.1
python-dateutil        2.8.1
python-jsonrpc-server  0.3.4
python-language-server 0.34.1
pytz                   2020.1
PyYAML                 5.3.1
pyzmq                  19.0.2
qtconsole              4.7.7
QtPy                   1.9.0
regex                  2020.7.14
requests               2.24.0
requests-oauthlib      1.3.0
rope                   0.17.0
rsa                    4.6
s3transfer             0.3.3
scikit-learn           0.23.2
scipy                  1.4.1
seaborn                0.11.0
selenium               3.141.0
Send2Trash             1.5.0
setuptools             49.6.0
six                    1.15.0
smart-open             2.1.1
snowballstemmer        2.0.0
tensorboard            2.3.0
tensorboard-plugin-wit 1.7.0
tensorflow             2.3.0
tensorflow-estimator   2.3.0
termcolor              1.1.0
terminado              0.8.3
testpath               0.4.4
threadpoolctl          2.1.0
toml                   0.10.1
tornado                6.0.4
tqdm                   4.49.0
traitlets              5.0.4
tweepy                 3.9.0
twython                3.8.2
typed-ast              1.4.1
typing-extensions      3.7.4.3
ujson                  1.35
urllib3                1.25.10
virtualenv             20.0.31
wcwidth                0.2.5
webencodings           0.5.1
Werkzeug               1.0.1
wheel                  0.35.1
widgetsnbextension     3.5.1
wrapt                  1.12.1
xlrd                   1.2.0
yapf                   0.30.0
zipp                   3.1.0
#+end_example

* capture.py
#+begin_src ipython 
  import cv2
  import numpy as np
  import time
  %matplotlib inline
  import matplotlib.pyplot as plt

  # cv = cv2.imread('target286.jpg')
  # cv2.imshow('target', cv)
  # time.sleep(2)
  # cv.close()

  cap = cv2.VideoCapture(0)
  if (cap.isOpened() == False):
    print("Unable to read camera feed")
  frame_width = int(cap.get(3))
  frame_height = int(cap.get(4))
  i=0
  while (True):

      ret, frame = cap.read()

      if ret == True:

          # Write the frame into the file 'output.avi'


          # Display the resulting frame
          # cv2.imshow('frame', frame)

          cimage_name = 'target%d.jpg' % (i)
          cv2.imwrite(cimage_name, frame)
          # Show the image which was just taken.
          i = i + 1

          # Press Q on keyboard to stop recording
          if cv2.waitKey(1) & 0xFF == ord('q'):
              break

      # Break the loop
      else:
          break

      # When everything done, release the video capture and video write objects
  cap.release()


  # Closes all the frames
  cv2.destroyAllWindows()



  # vs = cv2.VideoCapture(filename)
  # (grabbed, frame) = vs.read()
  # cimage_name = 'target%d.jpg' % (i)
  # cv2.imwrite(save_file_path + cimage_name, frame)
  # # Show the image which was just taken.
  # display(Image(filename))
  # i = i + 1
#+end_src

#+RESULTS:
: # Out[7]:
# Out[5]:
# Out[4]:
# Out[3]:
# Out[1]:
# Out[3]:
# Out[2]:
# Out[1]:

* test
#+begin_src bash 
  python mglearn201021.py
  # ffmpeg -f avfoundation -list_devices true -i ""
  # ffmpeg -ss 0.5 -f avfoundation -i "0" -t 1 capture.jpg
#+end_src

#+RESULTS:
